In [5]:
# importing pandas and numpy library
import pandas as pd
import numpy as np

In [6]:
df = pd.read_csv(r"C:\Users\HP\Downloads\Messy data set.csv")
df

     ID     Name         Age               Email    JoinDate    Salary
0     1    Alice          25   alice@example.com  2020-01-01     50000
1     2      Bob          30     bob@example.com  not a date     60000
2     2      Bob          30     bob@example.com  2020-02-01     60000
3     4  Charlie         NaN            charlie@  2020-03-01     70000
4     5    David  Twenty-two                 NaN  2020-04-01       NaN
5     6      Eve          45         eve@example  2020-05-01     90000
6     7    Frank          50  frank@@example.com  2020/06/01    100000
7     8    Grace          55   grace@example.com  01-07-2020  one lakh
8  nine    Heidi          60   heidi@example.com  2020.08.01    120000
9    10      NaN          65      10@example.com  2020-09-01    130000

In [8]:
df.columns

Index(['ID', 'Name', 'Age', 'Email', 'JoinDate', 'Salary'], dtype='object')

In [9]:
df.dtypes

ID          object
Name        object
Age         object
Email       object
JoinDate    object
Salary      object
dtype: object

In [17]:
# want to update specific cells
df.at[8,'ID'] = 9
df.at[9,'ID'] = 10
df.at[9,'Name'] = 'John'

In [18]:
df.tail()

   ID   Name Age               Email    JoinDate    Salary
5   6    Eve  45         eve@example  2020-05-01     90000
6   7  Frank  50  frank@@example.com  2020/06/01    100000
7   8  Grace  55   grace@example.com  01-07-2020  one lakh
8   9  Heidi  60   heidi@example.com  2020.08.01    120000
9  10   John  65      10@example.com  2020-09-01    130000

In [26]:
print(df['Age'].unique())
df.at[4,'Age'] = '60'
df.at[2,'Age'] = '30'

['25' '30' '60' '45' '50' '55' '65']

In [28]:
# changing datatype of id, age and salary
df['ID'] = pd.to_numeric(df['ID'], errors='coerce')
df['Age'] = pd.to_numeric(df['Age'], errors='coerce')
df['Salary'] = pd.to_numeric(df['Salary'], errors='coerce')
df

   ID     Name  Age               Email    JoinDate    Salary
0   1    Alice   25   alice@example.com  2020-01-01   50000.0
1   2      Bob   30     bob@example.com  not a date   60000.0
2   2      Bob   30     bob@example.com  2020-02-01   60000.0
3   4  Charlie   60            charlie@  2020-03-01   70000.0
4   5    David   60                 NaN  2020-04-01       NaN
5   6      Eve   45         eve@example  2020-05-01   90000.0
6   7    Frank   50  frank@@example.com  2020/06/01  100000.0
7   8    Grace   55   grace@example.com  01-07-2020       NaN
8   9    Heidi   60   heidi@example.com  2020.08.01  120000.0
9  10     John   65      10@example.com  2020-09-01  130000.0

In [30]:
# filling missing value of age and salary
df['Salary'] = df['Salary'].fillna(df['Salary'].median())
df

   ID     Name  Age               Email    JoinDate    Salary
0   1    Alice   25   alice@example.com  2020-01-01   50000.0
1   2      Bob   30     bob@example.com  not a date   60000.0
2   2      Bob   30     bob@example.com  2020-02-01   60000.0
3   4  Charlie   60            charlie@  2020-03-01   70000.0
4   5    David   60                 NaN  2020-04-01   85000.0
5   6      Eve   45         eve@example  2020-05-01   90000.0
6   7    Frank   50  frank@@example.com  2020/06/01  100000.0
7   8    Grace   55   grace@example.com  01-07-2020   85000.0
8   9    Heidi   60   heidi@example.com  2020.08.01  120000.0
9  10     John   65      10@example.com  2020-09-01  130000.0

In [34]:
# sorting age column in ascending order
df.sort_values(by=['Age'], ascending=True)
df.head()

   ID     Name  Age              Email    JoinDate   Salary
0   1    Alice   25  alice@example.com  2020-01-01  50000.0
1   2      Bob   30    bob@example.com  not a date  60000.0
2   2      Bob   30    bob@example.com  2020-02-01  60000.0
3   4  Charlie   60           charlie@  2020-03-01  70000.0
4   5    David   60                NaN  2020-04-01  85000.0

In [37]:
# filtering age greater than 80
df[df['Age'] <=50]

   ID   Name  Age               Email    JoinDate    Salary
0   1  Alice   25   alice@example.com  2020-01-01   50000.0
1   2    Bob   30     bob@example.com  not a date   60000.0
2   2    Bob   30     bob@example.com  2020-02-01   60000.0
5   6    Eve   45         eve@example  2020-05-01   90000.0
6   7  Frank   50  frank@@example.com  2020/06/01  100000.0

In [43]:
bobAlice_row = df[df['Name'].isin(['Bob', 'Alice'])]
bobAlice_row

   ID   Name  Age              Email    JoinDate   Salary
0   1  Alice   25  alice@example.com  2020-01-01  50000.0
1   2    Bob   30    bob@example.com  not a date  60000.0
2   2    Bob   30    bob@example.com  2020-02-01  60000.0

In [44]:
df['Salary']

0     50000.0
1     60000.0
2     60000.0
3     70000.0
4     85000.0
5     90000.0
6    100000.0
7     85000.0
8    120000.0
9    130000.0
Name: Salary, dtype: float64

In [47]:
# filtering the data with condition of salary greater than 50000 and less than 80000
df[(df['Salary'] > 50000) & (df['Salary'] < 80000)]

   ID     Name  Age            Email    JoinDate   Salary
1   2      Bob   30  bob@example.com  not a date  60000.0
2   2      Bob   30  bob@example.com  2020-02-01  60000.0
3   4  Charlie   60         charlie@  2020-03-01  70000.0

In [49]:
# iloc
df.iloc[2]

ID                        2
Name                    Bob
Age                      30
Email       bob@example.com
JoinDate         2020-02-01
Salary              60000.0
Name: 2, dtype: object

In [53]:
# loc
df.loc[2,'Salary']

60000.0